Revit 2027 API
Document.IsFamilyDocument Property
Identifies if the current document is a family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFamilyDocument { get; }
Public ReadOnly Property IsFamilyDocument As Boolean
	Get
public:
property bool IsFamilyDocument {
	bool get ();
}
member IsFamilyDocument : bool with get
Property Value
Boolean
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace